<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">

        <style>
            body { 
                font-family: DejaVu Sans;
                font-size: 10pt;
                line-height: 1.5;
            }

            h3 {
                margin-bottom: 1.5em;
                font-size: 12pt;
                font-weight: bold;
                text-align: center;
            }

            p {
                margin: 1em 0;
                padding: 0;
            }


            .text-center {
                text-align: center;
            }


            .page-break {
                page-break-before: always;
            }

            .image-full {
                display: block;
                max-width: 100%;
                margin: 1.5em 0;
            }


            .page1__title {
                padding: 12em 0;
                font-size: 12pt;
                font-weight: bold;
                text-align: center;
            }

            .page1__author {
                max-width: 50%;
                margin: 0 auto;
                text-align: center;
            }

            .page1__author__name {
                font-weight: bold;
            }

            .page1__comment {
                position: absolute;
                bottom: 0;
                left: 0;
                right: 0;   
            }


            .heng-table {
                width: 100%;
                margin: 2.5em 0;
            }

            .heng-table th {
                padding-bottom: .3em;
                vertical-align: top;
                text-align: left;
                
            }

            .heng-table td {
                padding-bottom: .3em;
                vertical-align: top;
            }

            .heng-table td:last-child {
                text-align: center;
            }

            
        </style>
        
    </head>
    <body>


        {{--  page 1 --}}
        <div class="page1__title">
            {{ $step1['Название клинического случая'] }}
        </div>

        <div class="page1__author">
            <div class="page1__author__name">
                {{ $step1['Фамилия'] }} {{ $step1['Имя'] }} {{ $step1['Отчество'] }}
            </div>
            <div class="page1__author__info">
                {{ $step1['Должность'] }} {{ $step1['Место работы'] }} {{ $step1['Город'] }}
            </div>
            <div class="page1__author__date">
                {{ \Date::parse($step1['Дата'])->format('d.m.Y') }}
            </div>
        </div>

        <div class="page1__comment">
            Комментарий: {{ $step1['Комментарий'] }}
        </div>
        {{-- /page 1 --}}

        <div class="page-break"></div>

        {{--  page 2 --}}
        <div class="article">
            <p>
                @if ($step2['Пол'] == 'Женский')
                    Пациентка
                    {{ $step2['Инициалы'] }},
                    {{ $step2['Год рождения'] }}
                    г.р. считает себя больной с
                    {{ $step2['Болен с месяца'] }}
                    {{ $step2['Болен с года'] }} г.,
                    когда впервые появились жалобы на
                    {{ $step2['Описание жалоб'] }}.
                    <br>Пациентка обратилась к врачу по месту жительства. 
                @else
                    Пациент
                    {{ $step2['Инициалы'] }},
                    {{ $step2['Год рождения'] }}
                    г.р. считает себя больным с
                    {{ $step2['Болен с месяца'] }}
                    {{ $step2['Болен с года'] }} г.,
                    когда впервые появились жалобы на
                    {{ $step2['Описание жалоб'] }}.
                    <br>Пациент обратился к врачу по месту жительства. 
                @endif
               
            </p>

            <p>
                При обследовании выявлено:
            </p>

            @foreach ($step2['Обследования'] as $test)
                @if ( !empty($test['Дата']) )
                    <p>
                        <b>{{ $test['Тип'] }} {{ $test['Объект'] }} ({{ \Date::parse($test['Дата'])->format('d.m.Y') }}):</b>
                        <br>{{ $test['Описание и заключение'] }}
                    </p>
                @endif
            @endforeach

            @if ( !empty($step2['Рентгенография']['Дата']) )
                <p>
                    <b>Рентгенография органов грудной клетки ({{ \Date::parse($step2['Рентгенография']['Дата'])->format('d.m.Y') }})</b>
                    <br>{{ $step2['Рентгенография']['Описание и заключение'] }}
                </p>
            @endif

            @if ( !empty($step2['Сцинтиграфия']['Дата']) )
                <p>
                    <b>Сцинтиграфия костей ({{ \Date::parse($step2['Сцинтиграфия']['Дата'])->format('d.m.Y') }})</b>
                    <br>{{ $step2['Сцинтиграфия']['Описание и заключение'] }}
                </p>
            @endif

            @if ( !empty($step2['Биопсия']['Дата']) )
                <p>
                    <b>Проведена диагностическая биопсия
                    {{ $step2['Биопсия']['Объект'] }} ({{ \Date::parse($step2['Биопсия']['Дата'])->format('d.m.Y')  }})</b>
                    <br>{{ $step2['Биопсия']['Описание и заключение'] }}
                </p>
            @endif

        </div>

        <div class="article">
        
            <h3>Лабораторные исследования</h3>

            <p><b>Общий анализ крови</b></p>

            <p>ER {{ $step2['ОАК']['ER'] }} 1012/л </p>

            <p>Hb {{ $step2['ОАК']['Hb'] }} г/л</p>
            
            <p>Le {{ $step2['ОАК']['Le'] }} 109/л</p>
            
            <p>Tr {{ $step2['ОАК']['Tr'] }} 109/л</p>
            
            <p>СОЭ {{ $step2['ОАК']['СОЭ'] }} мм/ч</p>
            
            <p>п/я {{ $step2['ОАК']['п/я'] }} %</p>
            
            <p>с/я {{ $step2['ОАК']['с/я'] }} %</p>
            
            <p>Ly {{ $step2['ОАК']['Ly'] }} %</p>
            
            <p>Mo {{ $step2['ОАК']['Mo'] }} %</p>
            
            <p>Bas {{ $step2['ОАК']['Bas'] }} %</p>
            
            <p>Эо {{ $step2['ОАК']['Эо'] }} %</p>
            
            <p>АсАт {{ $step2['ОАК']['АсАт']['Значение'] }} Eд/л 
                (N = {{ $step2['ОАК']['АсАт']['N'] }} Eд/л)</p>
            
            <p>АлАт {{ $step2['ОАК']['АлАт']['Значение'] }} Eд/л 
                (N = {{ $step2['ОАК']['АлАт']['N'] }} Eд/л)</p>
            
            <p>ЛДГ {{ $step2['ОАК']['ЛДГ']['Значение'] }} Eд/л 
                (N = {{ $step2['ОАК']['ЛДГ']['N'] }} Eд/л)</p>
            
            <p>Скорректированный Ca2+ {{ $step2['ОАК']['Скорректированный Ca2+']['Значение'] }} мМ/л 
                (N = {{ $step2['ОАК']['Скорректированный Ca2+']['N'] }} Eд/л)</p>
            
            <p>Мочевина крови {{ $step2['ОАК']['Мочевина крови']['Значение'] }} мМ/л 
                (N = {{ $step2['ОАК']['Мочевина крови']['N'] }} Eд/л)</p>
            
            <p>Креатинин крови {{ $step2['ОАК']['Креатинин крови']['Значение'] }} мМ/л 
                (N = {{ $step2['ОАК']['Креатинин крови']['N'] }} Eд/л)</p>
            
            <p>Миелоциты {{ $step2['ОАК']['Миелоциты'] }} %</p>
            
            <p>Метамиел {{ $step2['ОАК']['Метамиел'] }} %</p>
  

        </div>
        {{-- /page 2 --}}


        {{--  page 3 --}}
        <div class="article">
            <h3>
                Критерии оценки прогноза ПКР по D. Heng*
            </h3>
            
            <table class="heng-table">
                <tr>
                    <th>Факторы риска</th>
                    <th>Значение показателя</th>
                    <th>Наличие факторов</th>
                </tr>
                <tr>
                    <td>Индекс Карновского (Шкала ECOG)</td>
                    <td>&lt; 80% (&gt; 1)</td>
                    <td>{{ $step3['Индекс Карновского (Шкала ECOG)'] }}</td>
                </tr>
                <tr>
                    <td>Время от постановки диагноза до начала терапии</td>
                    <td>менее 12 месяцев</td>
                    <td>{{ $step3['Время от постановки диагноза до начала терапии'] }}</td>
                </tr>
                <tr>
                    <td>Уровень гемоглобина</td>
                    <td>&lt; нижней границы нормы</td>
                    <td>{{ $step3['Уровень гемоглобина'] }}</td>
                </tr>
                <tr>
                    <td>Уровень лактатдегидрогеназы</td>
                    <td>До 1000 Ед/л</td>
                    <td>{{ $step3['Уровень лактатдегидрогеназы'] }}</td>
                </tr>
                <tr>
                    <td>Уровень скорректированного кальция</td>
                    <td>&gt; 10 мг/дл (или 2,5 ммоль/л)</td>
                    <td>{{ $step3['Уровень скорректированного кальция'] }}</td>
                </tr>
                <tr>
                    <td>Уровень нейтрофилов</td>
                    <td>&gt; 6,5 х 109/л</td>
                    <td>{{ $step3['Уровень нейтрофилов'] }}</td>
                </tr>
                <tr>
                    <td>Уровень тромбоцитов</td>
                    <td>&gt; 320 х 109/л</td>
                    <td>{{ $step3['Уровень тромбоцитов'] }}</td>
                </tr>
                <tr>
                    <td>Наличие метастатических очагов</td>
                    <td>{{ $step3['Количество Meta'] }}</td>
                    <td>{{ $step3['Наличие метастатических очагов'] }}</td>
                </tr>
            </table>

            <p>
                <b>Заключение:</b> В данном случае имеет место
                {{ $step3['Прогноз по MSKCC'] }} прогноз по MSKCC.  
            </p>

            @foreach ($step3_images as $image)
                <img src="{{ $image }}" alt="" class="image-full">
            @endforeach

            <p>
                Комментарий: {{ $step3['Комментарий'] }}
            </p>
        </div>
        
        {{-- /page 3 --}}


        {{--  page 4 --}}
        <div class="article">
            <p>
                {{ $step2['Пол'] === 'Женщина' ? 'Пациентке' : 'Пациенту' }} 
                была проведена операция по удалению первичной опухоли:
                <b>{{ $step4['Проведена операция'] }} </b>

                @if ( $step4['Проведена операция'] === 'Да')
                    <br>Выполнена
                    {{ $step4['Нефрэктомия']['Вид'] }} нефрэктомия
                    {{ $step4['Нефрэктомия']['Способ'] }} ({{ \Date::parse($step4['Нефрэктомия']['Дата'])->format('d.m.Y')  }})
                    
                    <br>Выполнена биопсия операционного материала. Проведено гистологическое исследование:
                    
                    <br>{{ $step4['Гистологическое исследование'] }}
                @endif
            </p>

            <p>
                <b>Таким образом, на основании данных обследования установлен диагноз:</b>
                
                <br>{{ $step4['Диагноз'] }}
            </p>

            <p>
                <b>Сопутствующие заболевания:</b>
                <ol>
                    @foreach ($step4['Сопутствующие заболевания'] as $disease)
                        <li>{{ $disease['Диагноз'] }}</li>
                    @endforeach
                </ol>
            </p>
        </div>
        {{-- /page 4 --}}

        {{--  page 5 --}}
        <div class="article">
            <h3>Терапия</h3>
            
            <p>
                Химиотерапевтическое лечение было начато через <b>{{ $step5['Лечение начато через']}}</b>
                месяцев с момента постановки диагноза.
            </p>

            @foreach ($step5['Линии терапии'] as $index => $therapy)
                <p>
                    <br>В качестве {{ $index + 1 }}-й линии начат прием: <b>{{ $therapy['Препарат'] }}</b>.
                
                    <br>Выбор данной терапевтической опции обусловлен: 
                    
                    <br><b>{{ $therapy['Обоснование выбора'] }}</b>
                    
                    <br>На фоне проводимой терапии состояние пациента: <b>{{ $therapy['Изменение состояния'] }}</b>.
                    
                    @if ($therapy['Изменение состояния'] === 'ухудшилось')

                        {{--  Ухудшение связано с --}}
                        @if ( $therapy['Ухудшение связано с'] === 'развитием побочных эффектов' )

                            <br>Ухудшение состояния связано с <b>{{ $therapy['Ухудшение связано с'] }}, таких как:
                            <br><b>{{ $therapy['Побочные эффекты'] }}</b>
                        
                        @elseif ( $therapy['Ухудшение связано с'] === 'прогрессированием заболевания' )

                            <br>Ухудшение состояния связано с <b>{{ $therapy['Ухудшение связано с'] }}.

                        @endif
                        {{-- /Ухудшение связано с --}}
                        

                        {{--  Принято решение о --}}
                        @if ( $therapy['Принято решение о'] === 'снижении дозы препарата' )
                            
                            <br>Было принято решение о <b>{{ $therapy['Принято решение о'] }}</b>,
                            с  <b>{{ $therapy['Cнижение дозы препарата']['c'] }}</b> мг. 
                            до <b>{{ $therapy['Cнижение дозы препарата']['до'] }}</b> мг.
                        
                        @elseif ( $therapy['Принято решение о'] === 'временной отмене препарата' )

                            <br>Было принято решение о <b>{{ $therapy['Принято решение о'] }}</b>.

                        @endif
                        {{-- /Принято решение о --}}

                        {{--  Лечение было --}}
                        @if ( $therapy['Лечение было'] === 'возобновлено') 

                            <br>Лечение было {{ $therapy['Лечение было'] }}
                            через <b>{{ $therapy['Лечение возобновлено']['через'] }}</b> недель 
                            в дозе <b>{{ $therapy['Лечение возобновлено']['в дозе'] }}</b> мг.
                        
                        @elseif ( $therapy['Лечение было'] === 'отклонено') 
                        
                            <br>Лечение было {{ $therapy['Лечение было'] }}.
                        
                        @endif 
                        {{-- /Лечение было --}}

                        <br>{{ $therapy['Комментарий'] }}
                        
                    @endif
                </p>

                <p>
                    При проведении контрольного обследования выявлено по данным:
                </p>

                @foreach ($therapy['Обследования'] as $test)
                    @if ( !empty($test['Дата']) )
                        <p>
                            <b>{{ $test['Тип'] }} {{ $test['Объект'] }} ({{ \Date::parse($test['Дата'])->format('d.m.Y') }}):</b>
                            <br>{{ $test['Описание и заключение'] }}
                        </p>
                    @endif
                @endforeach

                @if ( !empty($therapy['Рентгенография']['Дата']) )
                    <p>
                        <b>Рентгенография органов грудной клетки ({{ \Date::parse($therapy['Рентгенография']['Дата'])->format('d.m.Y')  }})</b>
                        <br>{{ $therapy['Рентгенография']['Описание и заключение'] }}
                    </p>
                @endif

                @if ( !empty($therapy['Сцинтиграфия']['Дата']) )
                    <p>
                        <b>Сцинтиграфия костей ({{ \Date::parse($therapy['Сцинтиграфия']['Дата'])->format('d.m.Y')  }})</b>
                        <br>{{ $therapy['Сцинтиграфия']['Описание и заключение'] }}
                    </p>
                @endif

                @if ( !empty($therapy['Биопсия']['Дата']) )
                    <p>
                        <b>Проведена диагностическая биопсия
                        {{ $therapy['Биопсия']['Объект'] }} ({{ \Date::parse($therapy['Биопсия']['Дата'])->format('d.m.Y')   }})</b>
                        <br>{{ $therapy['Биопсия']['Описание и заключение'] }}
                    </p>
                @endif

                @if ( isset($step5_images[$index] ) )
                    @foreach ($step5_images[$index] as $image)
                        <img src="{{ $image }}" alt="" class="image-full">
                    @endforeach
                @endif
        
                <h3>Лабораторные исследования</h3>

                <p><b>Общий анализ крови</b></p>

                <p>ER {{ $therapy['ОАК']['ER'] }} 1012/л </p>

                <p>Hb {{ $therapy['ОАК']['Hb'] }} г/л</p>
                
                <p>Le {{ $therapy['ОАК']['Le'] }} 109/л</p>
                
                <p>Tr {{ $therapy['ОАК']['Tr'] }} 109/л</p>
                
                <p>СОЭ {{ $therapy['ОАК']['СОЭ'] }} мм/ч</p>
                
                <p>п/я {{ $therapy['ОАК']['п/я'] }} %</p>
                
                <p>с/я {{ $therapy['ОАК']['с/я'] }} %</p>
                
                <p>Ly {{ $therapy['ОАК']['Ly'] }} %</p>
                
                <p>Mo {{ $therapy['ОАК']['Mo'] }} %</p>
                
                <p>Bas {{ $therapy['ОАК']['Bas'] }} %</p>
                
                <p>Эо {{ $therapy['ОАК']['Эо'] }} %</p>
                
                <p>АсАт {{ $therapy['ОАК']['АсАт']['Значение'] }} Eд/л 
                    (N = {{ $therapy['ОАК']['АсАт']['N'] }} Eд/л)</p>
                
                <p>АлАт {{ $therapy['ОАК']['АлАт']['Значение'] }} Eд/л 
                    (N = {{ $therapy['ОАК']['АлАт']['N'] }} Eд/л)</p>
                
                <p>ЛДГ {{ $therapy['ОАК']['ЛДГ']['Значение'] }} Eд/л 
                    (N = {{ $therapy['ОАК']['ЛДГ']['N'] }} Eд/л)</p>
                
                <p>Скорректированный Ca2+ {{ $therapy['ОАК']['Скорректированный Ca2+']['Значение'] }} мМ/л 
                    (N = {{ $therapy['ОАК']['Скорректированный Ca2+']['N'] }} Eд/л)</p>
                
                <p>Мочевина крови {{ $therapy['ОАК']['Мочевина крови']['Значение'] }} мМ/л 
                    (N = {{ $therapy['ОАК']['Мочевина крови']['N'] }} Eд/л)</p>
                
                <p>Креатинин крови {{ $therapy['ОАК']['Креатинин крови']['Значение'] }} мМ/л 
                    (N = {{ $therapy['ОАК']['Креатинин крови']['N'] }} Eд/л)</p>
                
                <p>Миелоциты {{ $therapy['ОАК']['Миелоциты'] }} %</p>
                
                <p>Метамиел {{ $therapy['ОАК']['Метамиел'] }} %</p>
  
                <p>
                    Констатировано наличие <b>{{ $therapy['Констатировано наличие']}}</b>.
                </p>
 
            @endforeach

            <div class="p-2"></div>
            
            <p>
                Комментарий: <b>{{ $step5['Комментарий'] }}</b>.
            </p>

            @if (isset($step5['Копирайт']))
                <p>
                    Данный клинический случай может быть представлен на образовательных мероприятиях:
                    <ul>
                        @foreach ($step5['Копирайт'] as $copyright)
                            <li><b>{{ $copyright }}</b></li>                          
                        @endforeach
                    </ul>
                </p>
            @endif
            
        </div>   
        {{-- /page 5 --}}


    </body>
</html>
