<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">

        <style>
            body { 
                font-family: DejaVu Sans;
            }

            .title {
                padding: 100px 0;
                font-size: 14pt;
                font-weight: bold;
                text-align: center;
            }

            .author {
                max-width: 300px;
                margin: 0 auto;
                font-size: 12pt;
                text-align: center;
            }

            .author__name {
                font-weight: bold;
            }

            .comment {
                position: absolute;
                bottom: 0;
                left: 0;
                right: 0;
                font-size: 10pt;
            }

            .article {
                font-size: 10pt;
            }

            .article h3 {
                font-size: 14pt;
                font-weight: bold;
            }

            .page-break {
                page-break-before: always;
            }
        </style>
        
    </head>
    <body>

        <div class="title">
            {{ $step1['Название клинического случая'] }}
        </div>

        <div class="author">
            <div class="author__name">
                {{ $step1['Фамилия'] }} {{ $step1['Имя'] }} {{ $step1['Отчество'] }}
            </div>
            <div class="author__info">
                {{ $step1['Должность'] }} {{ $step1['Место работы'] }} {{ $step1['Город'] }}
            </div>
            <div class="author__date">
                {{ $step1['Дата'] }}
            </div>
        </div>

        <div class="comment">
            {{ $step1['Комментарий'] }}
        </div>



        <div class="page-break"></div>



        <div class="article">
            <p>
                @if ($step2['Пол'] == 'Женский')
                    Пациентка
                    {{ $step2['Инициалы'] }},
                    {{ $step2['Год рождения'] }}
                    г.р. считает себя больной с
                    {{ $step2['Болен с месяца'] }}
                    {{ $step2['Болен с года'] }} г.,
                    когда в первые появились жалобы на
                    {{ $step2['Описание жалоб'] }}.
                    <br>Пациентка обратилась к врачу по месту жительства. 
                @else
                    Пациент
                    {{ $step2['Инициалы'] }},
                    {{ $step2['Год рождения'] }}
                    г.р. считает себя больным с
                    {{ $step2['Болен с месяца'] }}
                    {{ $step2['Болен с года'] }} г.,
                    когда в первые появились жалобы на
                    {{ $step2['Описание жалоб'] }}.
                    <br>Пациент обратился к врачу по месту жительства. 
                @endif
               
            </p>

            <p>
                При обследовании выявлено:
            </p>

            @foreach ($step2['Обследования'] as $test)
                @if ( !empty($test['Дата']) )
                    <p>
                        <b>{{ $test['Тип'] }} {{ $test['Объект'] }} ({{ $test['Дата'] }}):</b>
                        <br>{{ $test['Описание и заключение'] }}
                    </p>
                @endif
            @endforeach

            @if ( !empty($step2['Рентгенография']['Дата']) )
                <p>
                    <b>Рентгенография органов грудной клетки ({{ $step2['Рентгенография']['Дата'] }})</b>
                    <br>{{ $step2['Рентгенография']['Описание и заключение'] }}
                </p>
            @endif

            @if ( !empty($step2['Сцинтиграфия']['Дата']) )
                <p>
                    <b>Сцинтиграфия костей ({{ $step2['Сцинтиграфия']['Дата'] }})</b>
                    <br>{{ $step2['Сцинтиграфия']['Описание и заключение'] }}
                </p>
            @endif

            @if ( !empty($step2['Биопсия']['Дата']) )
                <p>
                    <b>Проведена диагностическая биопсия
                    {{ $step2['Биопсия']['Объект'] }} ({{ $step2['Биопсия']['Дата']  }})</b>
                    <br>{{ $step2['Биопсия']['Описание и заключение'] }}
                </p>
            @endif

        </div>

        <div class="article">
        
            <h3>Лабораторные исследования</h3>

            <p><b>Общий анализ крови</b></p>

            <p>
                ER [{{ $step2['ОАК']['ER'] }}] 1012/л 

                <br>Hb [{{ $step2['ОАК']['Hb'] }}] г/л 

                <br>Le [{{ $step2['ОАК']['Le'] }}] 109/л  

                <br>Tr [{{ $step2['ОАК']['Tr'] }}] 109/л  

                <br>СОЭ [{{ $step2['ОАК']['СОЭ'] }}] мм/ч

                <br>п/я  [{{ $step2['ОАК']['п/я'] }}] %

                <br>с/я [{{ $step2['ОАК']['с/я'] }}] %

                <br>Ly [{{ $step2['ОАК']['Ly'] }}] %

                <br>Mo [{{ $step2['ОАК']['Mo'] }}] %

                <br>Bas [{{ $step2['ОАК']['Bas'] }}] %

                <br>Эо [{{ $step2['ОАК']['Эо'] }}] %

                <br>АсАт [{{ $step2['ОАК']['АсАт']['Значение'] }}] Eд/л 
                    (N = [{{ $step2['ОАК']['АсАт']['N'] }}] Eд/л)

                <br>АлАт [{{ $step2['ОАК']['АлАт']['Значение'] }}] Eд/л 
                    (N = [{{ $step2['ОАК']['АлАт']['N'] }}] Eд/л)

                <br>ЛДГ [{{ $step2['ОАК']['ЛДГ']['Значение'] }}] Eд/л 
                    (N = [{{ $step2['ОАК']['ЛДГ']['N'] }}] Eд/л)

                <br>Скорректированный Ca2+ [{{ $step2['ОАК']['Скорректированный Ca2+']['Значение'] }}] мМ/л 
                    (N = [{{ $step2['ОАК']['Скорректированный Ca2+']['N'] }}] Eд/л)

                <br>Мочевина крови [{{ $step2['ОАК']['Мочевина крови']['Значение'] }}] мМ/л 
                    (N = [{{ $step2['ОАК']['Мочевина крови']['N'] }}] Eд/л)

                <br>Креатинин крови [{{ $step2['ОАК']['Креатинин крови']['Значение'] }}] мМ/л 
                    (N = [{{ $step2['ОАК']['Креатинин крови']['N'] }}] Eд/л)

                <br>Миелоциты [{{ $step2['ОАК']['Миелоциты'] }}] %
                
                <br>Метамиел [{{ $step2['ОАК']['Метамиел'] }}] %
            </p>

        </div>



        <div class="page-break"></div>






    </body>
</html>
